Revit 2027 API
EnergyAnalysisWindowType.Transmittance Property
 The visual light transmittance value (VLT-value) for the window type, from 0.0 to 1.0.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Transmittance { get; }
Public ReadOnly Property Transmittance As Double
	Get
public:
property double Transmittance {
	double get ();
}
member Transmittance : float with get
Property Value
Double
See Also
Reference
EnergyAnalysisWindowType Class
Autodesk.Revit.DB.Analysis Namespace